---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.FlexPipe.EndTangent
source: html/fa54b3c9-d87c-014b-6bc7-f38ef05cf5bd.htm
---
# Autodesk.Revit.DB.Plumbing.FlexPipe.EndTangent Property

Gets or sets the tangent vector at the end of the curve. The invalid or zero vector is ignored when setting the tangent.

## Syntax (C#)
```csharp
public XYZ EndTangent { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null